<?php
return [
    'cabinet' => 'Кабинет пользователя',

    'txt_please_verify'         => '<h5>Пройдите верификацию</h5>
                                    <p>Чтобы получить доступ к полному функционалу test и покупке товаров в рассрочку до 9 000 000 сум! Верификация аккаунта займет 15 минут!</p>',


    'txt_please_edit_verify'         => '<h5>Отказ в верификации / требуется доработка</h5>
                                    <p>Вам отказано в верификации по причине: <b>:reason</b>.<br/>
                                    Пожалуйста устрание причины и попробуйте пройти верификацию еще раз.</p>',


    'txt_you_blocked'       => '<h5>Ваш аккаунт заблокирован!</h5>
                                <p>Пожалуйста, погасите задолженность по текущим договорам, что продолжить пользоваться услугами нашего сервиса.</p>',

    'you_blocked'  => 'Ваш аккаунт заблокирован!',

    'lbl_help_center'               => 'Центр справки и поддержки',
    'lbl_call_center'               => 'Тех. поддержка',
    'lbl_instruction'               => 'Инструкция по пользованию',

    'error_empty_sum'               => 'Сумма платежа указана неверно.',
    'error_card'                    => 'Не указана карта оплаты',
    'error_refill_fields'             => 'Введите сумму и укажите карту правильно!',
    'msg_refill_success'            => 'Лицевой счет успешно пополнен!',


    'menu_mobile_catalog'   => 'Каталог',
    'menu_mobile_favorite'  => 'Избранное',
    'menu_mobile_cart'      => 'Корзина',
    'menu_mobile_login'     => 'Войти',
    'menu_mobile_cab'       => 'Кабинет',
    'card_status1'       => 'Ваш договор Paycoin карты успешно создан в списке договоров.',
];
