<?php
return [
    'header_index'      => 'Кабинет покупателя',
    'personal_account'  => 'Пополнение лицевого счета',

    'cards_not_found'   => 'Вы еще не добавили ни одной карты в нашу систему.',
    'btn_add_card'      => 'Добавить карту',

    'my_cards'          => "Мои карты",
    'payment_sum'       => 'Сумма',

    'other_payment_methods' => 'Другие способы пополнения',

    'zcoin_bonus'               => 'Бонусы Paycoin',
    'txt_spend'                 => 'Потратить',

    'index_zcoin_1_name'        => 'Выбирай и Покупай товар у партнеров платформы test',
    'index_zcoin_1_text'        => 'Выбирайте товары у партнеров компаний test, ими являются магазины,бутики, маркеты и др. где прикреплен стикер test. Приобретайте данные товары через платформу test в рассрочку',

    'index_zcoin_2_name'        => 'Оплачивайте своевременно по рассрочке',
    'index_zcoin_2_text'        => 'После покупки через платформу test, консультант в магазине предоставит Вам документ с графиком платежей в котором указаны даты оплаты по рассрочке. Ориентируясь на эти даты погашайте свою рассрочку вовремя и получайте Paycoin бонусы',

    'index_zcoin_3_name'        => 'Получайте кэшбеком Paycoin бонусы',
    'index_zcoin_3_text'        => 'За каждые 10 000 сум вовремя погашенных Вы получаете 1 Paycoin Бонус. За данные Paycoin бонусы Вы можете приобрести бонусные пакеты в виде увеличение суммы рассрочки, срока рассрочки или же получить скидку на последующие покупки, а также участвовать в специальных предложениях нашей компании',
];
