<?php

return [
    'header_create'             => 'Создать регион',
    'header_edit'               => 'Редактировать регион',
    'header_postal_regions'     => 'Регионы (Узбекистон Почтаси)',
    'header_delete_confirm'     => 'Подтвердите удаление',

    'btn_add'                   => 'Добавить регион',

    'name'                      => 'Заголовок',
    'date'                      => 'Дата',

    'txt_empty_list'            => 'Список регионов пуст.',
    'txt_delete_confirm'        => 'Вы действительно хотите удалить регион? Удаление нельзя отменить.',
    'txt_created'               => 'Регион успешно создан!',
    'txt_updated'               => 'Регион успешно обновлен!',
    'txt_deleted'               => 'Регион успешна удален!',

    'choose_region'             => 'Выбрать регион',
    'katm_local_region'         => 'Регион КАТМ',
    'external_id'               => 'Внешний ID (Узбекистон Почтаси)',
];
