<?php

return [
    'header_catalog'            => 'Каталог',
    'product' => [
        'fields' => 'Характеристики',
    ],
    'category' => [
        'header_create'            => 'Создание категории',
        'header_edit'            => 'Редактирование категории',
        'list'            => 'Категории',
        'title'              => 'Наименование',
        'slug'               => 'Символьный код категории',
        'preview_text'       => 'Краткое описание',
        'detail_text'        => 'Полное описание',
        'image'              => 'Изображение',
        'sort'        => 'Сортировка',
        'search'             => 'Поиск',
        'parent_category' => 'Родительская категория',
        'no_parent' => 'Базовая категория',

        'create'      => 'Создать категорию',
        'edit'      => 'Редактировать категорию',
        'detail'     => 'Категория детально',



        'txt_empty_list'            => 'Список категорий пуст.',
        'txt_delete_confirm'        => 'Вы действительно хотите удалить категорию? Удаление нельзя отменить.',
        'txt_created'               => 'Категория успешно создана!',
        'txt_updated'               => 'Категория успешно отредакторована!',
        'txt_deleted'               => 'Категория успешна удалена!',
        'err_category_have_childs'               => 'Нельзя удалить категорию, в которой есть подкатегории.',
    ],
    'field' => [
        'header'            => 'Поля товаров',
        'header_create'            => 'Создание поля товаров',
        'header_edit'            => 'Редактирование поля товаров',
        'list'            => 'Поля товаров',
        'title'              => 'Название',
        'sort'        => 'Сортировка',
        'create'      => 'Создать поле товаров',
        'edit'      => 'Редактировать поле товаров',
        'delete'     => 'Удалить',

        'btn_add'               => 'Добавить поле',
        'header_delete_confirm' => 'Подтвердите удаление',

        'txt_created'           => 'Поле товара успешно добавлено!',
        'txt_deleted'           => 'Поле товара успешно удалено!',
        'txt_updated'           => 'Поле товара успешно обновлено!',
        'txt_delete_confirm'    => 'Удаленное поле нельзя восстановить.',
    ]

];

