<?php

return [
    'header_create'             => 'Создать акцию',
    'header_edit'               => 'Редактировать акцию',
    'header_discounts'          => 'Акции',
    'header_delete_confirm'     => 'Подтвердите удаление',

    'btn_add'                   => 'Добавить акцию',

    'title'                     => 'Заголовок',
    'slug'                      => 'Символьный код',
    'preview_text'              => 'Анонс',
    'detail_text'               => 'Текст акции',

    'dates'                     => 'Даты проведения',

    'date_start'                => 'Дата начала',
    'time_start'                => 'Время начала',
    'date_end'                  => 'Дата завершения',
    'time_end'                  => 'Время завершения',

    'amount'                    => 'Сумма покупки',
    'period'                    => 'Период рассрочки',

    'discount_3'                 => 'Срок 3 мес.',
    'discount_6'                 => 'Срок 6 мес.',
    'discount_9'                 => 'Срок 9 мес.',
    'discount_12'                => 'Срок 12 мес.',


    'from'                      => 'От',
    'to'                        => 'До',

    'description'               => 'Описание акции',

    'images'                     => 'Изображения',
    'image_list'                => 'Изображние в списке',
    'image_detail'              => 'Детальное изображние',

    'txt_all'                   => 'Все',
    'status_0'                  => 'Черновики',
    'status_1'                  => 'Опубликованные',
    'status_8'                  => 'Архив',

    'txt_empty_list'            => 'Список акций пуст.',
    'txt_delete_confirm'        => 'Вы действительно хотите удалить акцию? Удаление нельзя отменить.',
    'txt_created'               => 'Акция успешно создана!',
    'txt_updated'               => 'Акция успешно обновлена!',
    'txt_deleted'               => 'Акция успешна удалена!',
    'txt_published'             => 'Акция успешно опубликована',
    'txt_archived'              => 'Акция успешно заархивирована!',
];
