<?php

return [
    'header_create'             => 'Создать новость',
    'header_edit'               => 'Редактировать новость',
    'header_news'               => 'Новости',
    'header_delete_confirm'     => 'Подтвердите удаление',

    'btn_add'                   => 'Добавить новость',

    'title'                     => 'Заголовок',
    'date'                      => 'Дата',
    'slug'                      => 'Символьный код новости',
    'preview_text'              => 'Анонс',
    'detail_text'               => 'Текст новости',
    'image'                     => 'Изображение',

    'txt_empty_list'            => 'Список новостей пуст.',
    'txt_delete_confirm'        => 'Вы действительно хотите удалить новость? Удаление нельзя отменить.',
    'txt_created'               => 'Новость успешно создана!',
    'txt_updated'               => 'Новость успешно обновлена!',
    'txt_deleted'               => 'Новость успешна удалена!',
    'txt_published'             => 'Новость успешно опубликована',
    'txt_archived'              => 'Новость успешно заархивирована!',

    'txt_all'                   => 'Все',
    'status_0'                  => 'Черновики',
    'status_1'                  => 'Опубликованные',
    'status_8'                  => 'Архив',

    'type'                      => 'Тип новости',
    'type_mobile'               => 'Мобильная',
    'type_simple'               => 'Обычная',

];
