<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
    <style>
        p, h1, h2, h3 h4, h5 {
            margin: 0;
            padding: 0;
        }

        html {
            box-sizing: border-box;
            padding: 0;
            margin: 0;
            font-size: 12px;
            text-align: justify;
            background-color: #F6F6F6;
        }

        body {
            font-family: DejaVu Sans, sans-serif;
            max-width: 1200px;
            margin: 32px 20px;
        }

        .content-block {
            padding-left: 40px;
        }
    </style>
</head>
<body>

<h2 style="text-align: center"><strong>Договор ОНЛАЙН-ЗАЙМА <br> ЭЛЕКТРОННАЯ ОФЕРТА</strong></h2>
<h3>1- Предмет электронной оферты</h3>
<ol>
    <li>
        В настоящей электронной оферте используются следующие понятия:
        <br>
        <p><strong>Микрофинансовая организация в форме общества с ограниченной ответственностью
                "SHAFFOF-MOLIYA" </strong>(далее
            &ndash; <strong>микрофинансовая</strong> организация) является юридическим лицом, которое сотрудничает с АО
            &laquo;SOLUTIONS
            LAB&raquo; (далее Общество), по предоставлению краткосрочных онлайн микрозаймов физическим лицам для
            приобретения
            товаров, оплаты работ и услуг Партнеров системы resus Nasiya;</p>
        <p><strong>Платформа </strong>&ndash; система resus Nasiya, программно-аппаратный комплекс организационных,
            информационных и технических решений, обеспечивающие взаимодействие и обмен информацией между Платформой,
            Обществом,
            Микрофинансовой организации или агентом системы электронных денег, Клиента и Партнером, в целях получения
            микрозайма
            с последующей оплатой за товары, работы и услуги в рамках Партнерской сети.</p>
        <p><strong>Договор микрозайма - </strong>денежные средства, выделенные микрофинансовой организацией
            должнику/клиенту на
            основании проведенного скоринга платежеспособности клиента Обществом с учетом срока, возможности
            возврата предусмотренных для оплаты товаров, работ и услуг приобретенных у Партнеров;</p>
        <p><strong>должник &ndash; клиент </strong>- физическое лицо, покупающее товары у Партнеров за онлайн-займ,
            прошедшее
            цифровую идентификацию (цифровую аутентификацию) в соответствии с процедурой, установленной
            законодательством
            Республики Узбекистан, владеющее банковской картой, выпущенной одним из коммерческих банков Республики
            Узбекистан;
        </p>
        <p><strong>посредническая комиссия </strong>&mdash; это доход Общества, взимаемый с Должника-клиента за
            использование
            электронных кошельков, проведение платежей в рамках resus Nasiya, обработку договоров микрозаймов и прочие
            функции
            системы resus Nasiya . Посредническая комиссия взимается со счета, без отражения в электронном предложении
            каждого
            онлайн-займа (вычитается);</p>
        <p><strong>должник/клиент</strong> &ndash; физические лица получившие через систему resus Nasiya онлайн микрозайм
            для
            приобретения товаров, оплаты работ и услуг у Парнеров системы resus Nasiya на условиях предусмотренных
            настоящей
            публичной офертой..;</p>
        <p><strong>Партнер </strong>&ndash; юридическое лицо (или индивидуальный предприниматель без образования
            юридического
            лица), зарегистрированное в системе resus Nasiya с целью приемки платежей за проданный товар, оказанные
            работы и
            услуги через систему resus Nasiya. <strong>показатель займовой нагрузки </strong>&ndash; отношение
            среднемесячной
            суммы платежа заемщика/клиента по займным и другим обязательствам к сумме его среднемесячного дохода;</p>
        <p><strong>среднемесячная сумма платежа </strong>представляет собой среднее арифметическое значение ежемесячных
            платежей, произведенных заемщиком/клиентом в соответствии с соглашениями, заключенными и предназначенными
            для
            заключения со всеми заемщиками, а также сделками, в которых заемщик/клиент участвует в качестве гаранта;</p>
        <p><strong>среднемесячный доход </strong>&mdash; это среднее арифметическое значение дохода, полученного
            заемщиком/клиентом через банковскую карту, выпущенную на основе зарплатного проекта за последние 12 месяцев
            по
            сравнению с датой отражения Электронного предложения (если проработал менее 12 месяцев, период, отработанный
            в
            действительности, не менее 6 месяцев);</p>
        <p><strong>документ, удостоверяющий личность </strong>- паспорт или удостоверение личности гражданина Республики
            Узбекистан, вид на жительство или удостоверение личности иностранного гражданина и лица без гражданства,
            постоянно
            проживающего в Республике Узбекистан.</p>

    </li>
    <li>После того, как должник/клиент подпишет соглашение об электронной оферте, в микрофинансовой организации будет
        открыт счет онлайн-задолженности на имя должника/клиента, и с этого счета на электронный кошелек будет зачислена
        сумма онлайн-микрозайма, выделенная должнику/клиенту.
    </li>
    <li>На основании электронного предложения денежные средства, переведенные микрофинансовой организацией, оформляются
        как онлайн-займ заемщику/клиенту.
    </li>
</ol>
<h3 style="text-align: center">
    <strong>2-&sect;.</strong><strong>Условия</strong><strong>Онлайн-</strong><strong>займа</strong></h3>
<ul style="list-style: none">
    <li style="line-height: 20px">4.Онлайн-займ распределяется на срок до 12 (двенадцать) месяцев.</li>
    <li style="line-height: 20px">5.Максимальная сумма онлайн микрозайма не превышает {{$totalValue}} сум ({{ Str::ucfirst(num2str($totalValue)) }}). </li>
    <li style="line-height: 20px">6.Микрофинансовая организация
        может наложить территориальное ограничение на распределение онлайн-займа.
    </li>
    <li style="line-height: 20px">7.Онлайн микрозайзайм распределяется между заемщиком/клиентом на основе проведенного
        скоринга Обществом.
    </li>
    <li style="line-height: 20px">8.В процессе скоринга Микрофинансовая организация имеет право не выделяется
        заемщику/клиенту онлайн микрозайм
        при
        наличии одной из следующих ситуаций:
    </li>

    <li style="line-height: 20px">а) при наличии просроченной задолженности по ранее полученным займам и другим
        обязательствам;
    </li>
    <li style="line-height: 20px">Г) когда доход должника/клиента на базе ГУП "Налоговая служба" составляет менее 6
        месяцев;
    </li>
    <li style="line-height: 20px">д) при отсутствии информации о доходах должника/клиента за 2 месяца до месяца подачи
        заявки на онлайн-займа на
        базе
        ГУП "Налоговая служба";
    </li>
    <li style="line-height: 20px">е) если банковская карта, выпущенная для обращения заемщика/клиента, не была зачислена
        за последние 2 месяца;
    </li>
    <li style="line-height: 20px">ж) когда должник/клиент не попадает в возрастной диапазон от 22 до 65 лет;</li>
    <li style="line-height: 20px">з) в том случае, если показатель займовой нагрузки превышает 50 процентов, при расчете
        также добавляется
        стоимость
        онлайн-займа.
    </li>
    <li style="line-height: 20px">9.Заемщик/клиент может использовать утвержденный лимит онлайн-займа в течение 12
        месяцев. Срок действия
        утвержденного лимита рассчитывается с момента отправки SMS-уведомления об утверждении лимита. Утвержденный
        лимит, независимо от того, сколько его частей они используют, считается утратившим свою силу после одного
        использования.
    </li>
    <li style="line-height: 20px">10.За использованный онлайн микрозайма оплата в виде процентов с заемщика/клиента не
        взимается.
    </li>
    <li style="line-height: 20px">11.Онлайн микрозайм возвращается заемщиком/клиентом в соответствии с графиком
        погашения онлайн-займа.
    </li>
    <li style="line-height: 20px">12.Онлайн микрозайм выделяется в виде микро займовой линии на 12 месяцев с
        возобновляемым остатком в момент
        погашения части микрозайма.
    </li>
</ul>
<h3 style="text-align: center">
    <strong>3-&sect;.Права и обязанности сторон</strong>
</h3>
<h4><strong>13. Права</strong><strong> микрофинансовой организации</strong><strong>:</strong></h4>
<div class="content-block">
    <p>а)когда дело доходит до срока онлайн-оплаты микрозайма,списать займ со счета банковской карты заемщика /
        клиента;</p>
    <p>б) при не возврате онлайн-микрозайма в установленный срок (невозврат суммы займа или погашение задолженности в
        установленный срок), для его возврата направить взыскание на средства, находящиеся на счетах и банковских картах
        имевшихся на момент подписания договора, а так же открытых позже в других банках Республики Узбекистан, открытых
        на
        имя должника/клиента, внести соответствующие сведения и принять меры, указанные в этой электронной оферте;</p>
    <p>в) информировать заемщика/клиента о заявке на урегулирование спора в случае нарушения срока погашения
        онлайн-займа;</p>
    <p>д) передача права онлайн-взыскания задолженности по микрозайму страховой организации, когда онлайн микрозайм
        покрывается страховой организацией в результате невозврата займа в течение указанного периода.</p>
</div>
<h4><strong>14. Обязательства</strong><strong> микрофинансовой организации</strong><strong>:</strong></h4>
<div class="content-block">
    <p>а) оформить онлайн микрозайм на условиях, изложенных в настоящем электронном предложении;</p>
    <p>б) информировать заемщика/клиента о причинах досрочного погашения онлайн-</p>
    <p>микрозайма;</p>
    <p>в) от заемщика/клиента онлайн - определяется в онлайн-графике погашения</p>
    <p>займа для текущего платежа по займу. Если вносится относительно большая сумма средств, то превышение полученной
        суммы
        направляется на погашение займа к следующему месяцу;</p>
    <p>д) в целях предотвращения дальнейшего увеличения займовой нагрузки на должника/клиента в случае возникновения
        просроченной задолженности по онлайн- займу проинформировать должника/клиента о возникновении просроченной
        задолженности с использованием любых средств связи, включая электронную связь, в течение 7 календарных дней с
        момента дата возникновения этого заимствования, с указанием;</p>
    <p>е) информировать должника/клиента о статусе, сроке действия, стоимости, составе и последствиях неисполнения
        обязательства по погашению непогашенной задолженности, которая была просрочена по данному электронному
        предложению;</p>
    <p>и) автоматическое формирование информации о том, что должник/клиент полностью погасил задолженность по
        онлайн-займу в
        личном кабинете должника/клиента после полной оплаты займа по онлайн-займу.</p>
</div>

<p><strong>16. Права должника/клиента:</strong></p>
<div class="content-block">
    <p>а)принять независимое решение об отражении данного электронного предложения;</p>
    <p>б) требовать своевременного распределения онлайн-займа;</p>
    <p>в) досрочно отменить данное электронное предложение после полной оплаты онлайн-займа в любое время.</p>
</div>
<p><strong>17. Обязательства должника/клиента:</strong></p>
<div class="content-block">
    <p>а) онлайн - своевременное погашение займа;</p>
    <p>б) ознакомится с офертой;</p>
    <p>в) незамедлительно информировать Общество и микрофинансовую организацию о смене персональных данных, адреса
        прописки,
        номере телефона и иных данных необходимых для исполнения процедуры взыскания средств при наступлении графика
        платежей;</p>
</div>
<h4><strong>4-&sect;.Ответственность сторон</strong></h4>
<div class="content-block">
    <p>17. В случае, если стороны не выполняют обязательства по настоящей Электронной Оферте или не выполняют их на
        требуемом уровне, к ним применяются меры ответственности, предусмотренные законодательством Республики
        Узбекистан.</p>
</div>
<h4><strong>5-&sect;.Форс-мажор</strong></h4>
<div class="content-block">
    <p>18. Стороны не несут ответственность за частичное или полное неисполнение своих обязательств по Электронной
        Оферте в
        период, в течение которого действует форс-мажор.</p>
    <p>К наиболее важным обстоятельствам относятся: чрезвычайные ситуации, вызванные природными явлениями
        (землетрясения,
        оползни, засухи и другие природные явления) или социально-экономические ситуации (экономические санкции, военные
        действия, забастовки, осады, ограничительные и запретительные меры между государственными организациями и
        государственными организациями, решения правительства и т.д.), непредвиденные случаи и непредвиденные ситуации
        которые не могут быть устранены в текущих условиях, если эти ситуации оказывают непосредственное влияние на
        выполнении условий по электронной оферте.</p>
    <p>Когда возникают ситуации форс-мажорные ситуации, и когда это прекращается, стороны немедленно информируют друг
        друга.
        Уведомление направляется всеми доступными для сторон средствами связи.</p>
    <p>В случае наступления обстоятельств, связанных с форс-мажором, у сторон срок исполнения обязательств откладывается
        пропорционально периоду, на который действительны случаи, связанные с форс-мажорами.</p>
    <h4><strong>6-&sect;.Разрешение споров</strong></h4>
    <p>19. Микрофинансовая организация и должник/клиент, по взаимному согласию сторон, вправе применять установленные
        законом методы разрешения спора, в том числе путем переговоров.</p>
    <p>20. Все споры, связанные с неисполнением, или ненадлежащим исполнением обязательств, Стороны будут стараться
        решить
        в ходе переговоров и направления претензий. Срок рассмотрения претензии составляет 3 календарных дня с даты
        направления претензии в адрес получателя претензии.</p>
    <p>21. В случае не достижения согласия в ходе переговоров и при соблюдении претензионного порядка, споры будут
        разрешаться в судебном порядке в соответствии с действующим законодательством Республики Узбекистан по месту
        нахождения Микрофинансовой организации (договорная подсудность), уполномоченным государственным судом РУз.</p>
</div>
<h4><strong>7-&sect;. Другие условия электронной оферты</strong></h4>
<div class="content-block">
    <p>22. Считается, что заемщик/клиент согласился обработать информацию, касающуюся его/ее личности, путем отображения
        Электронного Предложения.</p>
    <p>23. Микрофинансовая организация создает возможность для заемщика/клиента удаленно осуществлять оплату
        онлайн-займа
        по данному электронному предложению.</p>
    <p>24. Микрофинансовая организация не имеет права в одностороннем порядке изменять условия онлайн- займа, включая
        срок
        действия настоящего электронного предложения.</p>
    <p>25. В случае смерти должника/клиента его права и обязанности разрешаются в соответствии с законодательством
        Республики Узбекистан.</p>
    <p>26. Настоящая электронная оферта действует с даты ее подписания должником/клиентом до полного выполнения
        обязательств по настоящей электронной оферте.</p>
    <p>27. Прекращение действия настоящей Электронной Оферты не освобождает стороны от обязанности удовлетворить
        взаимную
        претензию (требование), высказанную до тех пор, пока она не будет прекращена.</p>
    <p>28. Законодательство Республики Узбекистан применяется в случаях, не предусмотренных настоящей электронной
        офертой.</p>
</div>
<p>Не раскрыто оплата посреднической комиссии. Процедура досрочного взыскания (на 61 день имеем право на досрочное
    взыскание всего договора при наличии просрочки по договору).</p>
</body>
</html>
