<?php
return [
    'header_buyers'                 => 'Клиенты',

    'new_buyer'                     => 'Новый покупатель',
    'new_buyer_created'             => 'Покупатель успешно отправлен на модерацию!',

    'btn_create'                    => 'Добавить покупателя',
    'btn_check_status'              => 'Проверить пользователя',

    'txt_all'                       => 'Все покупатели',
    'txt_check'                    => 'Это может занять несколько минут',
    'txt_check_info'                => '<p><b>Наши специалисты проверят анкету клиента.</b></p>
                                        <p>В течении 15 минут клиент получит СМС-сообщение о результате верификации.</p>',

    'status_4'                      => 'Верифицированные',
    'status_3'                      => 'На верификации',
    'c_card_error'                  => 'Нельзя добавлять корпоративную карту',
    'invalid_card'                  => 'Неизвестный тип карты.',
    'empty_relations_info' => 'Заполните информацию о доверителях',
    'upload_all_photos' => 'Загрузите все фотографии покупателя!',
    'uzcard_denied' => 'Узкард временно недоступен!',

    'card_date_is_not_valid'       => 'Неправильный формат срока действия карты',
    'expiration_date_is_required'  => 'Введите срок действия карты!',
    'card_number_is_required'      => 'Введите номер карты!',

    'guarants_phone_match_error'           => 'Укажите другого доверителя',
    'bonus_amount'                         => 'Сумма',
    'seller_bonuses'                       => 'Продавец',
    'bonus_placeholder'                    => 'Введите срок',
    'this_card_is_already_linked_to_phone' => 'Данная карта уже привязана в системе к номеру',
    'invalid_card_date'                    => 'Неправильный формат срока действия карты',

    'card_number_is_incorrect'     => 'Номер карты некорректный',
    'not_payed_schedule_not_found' => 'Неоплаченных контрактов не найдено',
    'card_data_is_incorrect_try_later' => 'Данные карты были введены неправильно. Повторите попытку позже',
    'card_sms_off'                 => 'Смс информирование не подключено',
    'wrong_expiry_format'          => 'Неправильный формат срока действия карты',
    'internal_server_error'        => 'Неполадки на стороне сервера',
    'scoring_error'                => 'Сервис скоринга временно не доступен. Попробуйте позже!',
    'provided_expirydate_is_incorrect' => 'Дата истечения срока действия карты введена неверно',
    'guarants_name_length'         => 'Минимальное значение 5',
    "equal_phone_number"           => 'Нельзя вводить свой личный номер',
    "required"                     => 'Обязательное поле',
    "img_error"                    => 'Неправильный формат изображения',
    "invalid_phone_number"         => 'Некорректный номер телефона',
    "add_imei"                     => 'Добавить IMEI',
    "remove_imei"                  => "Удалить IMEI",
    "clarify_data"                 => "Уточнить данные",
    "delete"                       => "Удалить",
    'waiting_for_verification'     => 'В ожидании модерции',
    "guarants_added"               => "Доверители успешно добавлены",
    "splash_title"  => "Пользователю предстоит пройти следующие этапы",
    "face_id"  => "MyID проверка",
    "fast_register" => "Регистрации быстрой покупки ",
    "full_register" => "Полная регистрация",
    "continue"      => "Продолжить"
];
