<?php

return [
    'txt_created'                       => 'Договор рассрочки успешно создан!',
    'txt_act_uploaded'                  => 'Акт загружен и отправлен на модерацию!',

    'err_partner_not_found'             => 'Партнер с таким ID не найден!',

    'act_view'                          => 'Посмотреть загруженный акт',
    'imei_view'                          => 'Посмотреть загруженный IMEI',
    'client_photo_view'                  => 'Посмотреть фото',

    'act_status_1'                      => 'Акт загружен и находится на модерации',
    'act_status_2'                      => 'Акт не прошел модерацию, загрузите еще раз',
    'cancel_act_status_2'               => 'Акт отмены - Отказано по причине:  ',
    'cancel_act_status_3'               => 'Акт отмены одобрен',
    'act_status_3'                      => 'Акт одобрен',

    'client_photo_status_3'             => 'Фото с клиентом загружено и находится на модерации',
    'client_photo_status_2'             => 'Фото с клиентом не прошло модерацию, загрузите еще раз',
    'client_photo_status_1'             => 'Фото с клиентом одобрено',

    'canceled_txt'                      => 'Договор отменен по причине Неправильного наименования товара',

    'imei_status_3'                      => 'IMEI загружен и находится на модерации',
    'imei_status_2'                      => 'IMEI не прошел модерацию, загрузите еще раз',
    'imei_status_1'                      => 'IMEI одобрен',
    'agree_cancel_contract'             => 'Вы действительно хотите отменить договор?',
    'photo_quality'                     => 'Файл должен быть четким, без бликов',
    'photo_formats'                     => 'Формат логотипа должен быть файлом одного из следующих типов: '

];
