<?php

return [
    'header' => 'Корзина',

    'cart_title'        => 'Наименование',
    'cart_quantity'     => 'Количество',
    'cart_price'        => 'Цена за шт.',
    'cart_sum'          => 'Всего',
    'cart_total'        => 'Общая стоимость',
    'credit_min_sum'    => 'В рассрочку от 1 300 000 в месяц',
    'select_all'        => 'Выбрать все',

    'empty'             => 'Корзина пуста',
    'your_order'        => 'Ваш договор',
    'make_order'        => 'Перейти к оформлению',
    'products'          => 'Товары',
    'text1'             => 'Доступные способы и время доставки можно выбрать при оформлении договора',
    'make_credit'       => 'Или оформить рассрочку',
    'zcoin_bonus'       => 'Бонусы zCoin',
    'zcoin_text2'       => 'при оформлении рассрочки',
    'zcoin_every'       => 'за каждый ежемесячный платеж',
    'zcoin_text1'       => 'Онлайн оформление рассрочки за 15 минут. <br> Вы можете выбрать срок рассрочки самостоятельно',
    'zcoin_make_credit' => 'Оформить рассрочку',

    'lbl_direct_buy' => 'Оплатить сейчас',
    'lbl_credit_buy' => 'Оформить рассрочку',

    'warning_order'         => 'Чтобы перейти к покупке, необходимо войти или зарегистрироваться.',
    'warning_credit'        => 'Чтобы оформить рассрочку войдите в свой аккаунт или зарегистрируйтесь',
    'warning_verify'        => 'Пройдите верификацию, чтобы оформлять товары в рассрочку, это займет 15 минут!',
    'warning_verify_btn'    => 'Пройти верификацию',

    'err_not_enough_limit'      => 'Сумма договора превышает доступный лимит рассрочки!',
];
