<?php

return [
    'meta_title'                                 => 'Сервис покупки товаров в рассрочку',

    'welcome_title'                             => 'test &mdash; покупаете вы, платим мы!',
    'welcome_text'                              => 'test — это сервис рассрочки, который поможет вам делать большие покупки в магазинах города и не отдавать всю сумму сразу. К нам подключены более 100 торговых точек Ташкента — вполне возможно, что и ваш любимый магазин тоже. Рассказываем, как зарегистрироваться в test и делать покупки проще.',

    'registration_title_become_buyer'           => 'Стать клиентом',
    'registration_title_become_partner'         => 'Стать партнером',
    'registration_text_partner'                 => 'Лидерство в продажах синхронизирует продуктовый ассортимент. Повышение жизненных стандартов детерминирует комплексный анализ ситуации.',
    'registration_text_buyer'                   => 'Зарегистрируйтесь на сайте все за несколько минут и получите доступ к товарам в рассрочку.',
    'registration_btn_register'                 => 'Пройти регистрацию',

    'news_title'                                => 'Новости',
    'news_all'                                  => 'Все новости',

    'partners_title'                            => 'Все популярные бренды - наши партнеры',
    'partners_all'                              => 'Все партнеры',

    'discounts_title'                           => 'Акции!',

    'best_price_products_title'     => 'Лучшие предложения!',
    'populate_products_title'       => 'Популярные товары',
    'new_products_title'            => 'Новинки',

    'section_how_title'                 => 'Все максимально просто!',
    'section_how_step1_name'            => 'Моментальная регистрация',
    'section_how_step1_text'            => '<p><b>Зарегистрируйся на сайте всего за минуту. Вам понадобится:</b></p>
                                            <ol>
                                                <li>Мобильный телефон</li>
                                                <li>Пластиковая карта</li>
                                                <li>Паспорт</li>
                                            </ol>',
    'section_how_step2_name'            => 'Получите верификацию',
    'section_how_step2_text'            => '<p>В течении 30 минут Вы получите смс сообщение о результате верификации случае успешного прохождения верификации на Вашем счету Paycoin будет открыт лимит на покупку в рассрочку от 3 000 000 до 9 000 000 сум</p>',
    'section_how_step3_name'            => 'Покупайте!',
    'section_how_step3_text'            => '<p>Самые популярные магазины уже принимают Оплату через сервис рассрочки Paycoin. Нужен только телефон. </p>',

];
