<?php

return [
    'title'     => 'Бонусы Paycoin',
    'h1'        => 'Бонусы Paycoin',
    'text'      => '<p>
                        test компания заботилась, заботится и будет заботиться о своих клиентах и награждать их разными бонусами.
                        Внутри системы есть своя бонусная валюта Paycoin. Данную валюту вы можете получить, выполняя лишь одно простое действие - это своевременная оплата своего ежемесячного платежа.
                        После каждой своевременной оплаты вам будут начисляться Zcoin бонусы в размере 1% от суммы оплаты.
                    </p>
                    <p>
                        Данную бонусную валюту вы сможете использовать на нашей платформе через платежный сервис Paycoin.
                        С помощью данного сервиса вы сможете оплатить за свой интернет-провайдер и мобильную связь.
                    </p>',
];
