<?php

return [
    'title' => 'О компании',

    'h1' => 'О компании',

    'position_timur' => 'Директор',
    'name_timur' => 'Эргашев Тимур',

    'position_akhliyor' => 'Отдел KYC',
    'name_akhliyor' => 'Гафуров Ахлиёр',

    'position_rinat' => 'Менеджер проектов',
    'name_rinat' => 'Гатауллин Ринат',

    'position_aziz' => 'Разработчик',
    'name_aziz' => 'Рыскулов Азиз',

    'position_lena' => 'Дизайнер',
    'name_lena' => 'Тен Елена',

    'position_yana' => 'Бухгалтер',
    'name_yana' => 'Варшавская Яна' ,

    'position_komil' => 'Менеджер по продажам',
    'name_komil' => 'Гапуров Комилжон' ,

    'position_german' => 'Менеджер по продажам',
    'name_german' => 'Домке Герман' ,

    'position_boxo' => 'Отдел KYC',
    'name_boxo' => 'Мухамедов Боходир' ,

    'logo_zm' => '"Без настоящей страсти и любви к работе невозможно достичь наилучших результатов".',

    'head_line' => 'Наша команда',

    'how_to_buy' => 'Как купить в рассрочку?',

    'text'         => '
        <p>test - это онлайн-платформа для приобретения товаров и услуг широкого спектра. При помощи test Вы, наши уважаемые клиенты, можете приобрести бытовую технику, мебель для дома и офиса, электронику, товары для дома, одежду, ювелирные украшения, канцелярские товары и многое другое.</p>
        <p>
        Наша команда безустанно трудится над тем, чтобы платформа была надёжной и комфортной площадкой для вашего онлайн-шоппинга.
        </p>
        <p>test - это:</p>
        <li>растущая компания с компетентным и профессиональным коллективом</li>
        <li>клиенты по всему Узбекистану </li>
        <li>300+ компаний - партнёров </li>
        <li>поддержка клиентов 24/7</li> <br>
        <p>
         Мы предоставляем гибкий срок действия рассрочки от 3 до 12 месяцев.
        </p>
        <p>
        Примечание: после регистрации и верификации на нашей платформе, пользователь получает лимит рассрочки, но списание средств происходит только после совершения покупки и списываться будет та сумма, на которую покупатель совершил покупку.
         Оставшийся лимит не будет сгорать, а также не будут начисляться какие-либо проценты, покупатель может совершать покупки на оставшийся его лимит, когда ему/ей необходимо.
        </p>',
];
