<?php

return [
    'title' => 'Оплата',

    'h1' => 'Оплата',

    'description' => 'Для удобства наших пользователей на нашей платформе есть всевозможные  способы оплаты: ',

    'section_how_step1_name'        => 'Автоматическое погашение с карты пользователя',
    'section_how_step2_name'        => 'Пополнение лицевого счета через карту в личном кабинете',
    'section_how_step3_name'        => 'Пополнение лицевого счёта через платежные сервисы ',

    'section_how_step1_text'        => '<p>Ежемесячно, в день оплаты (дата по договору), платформа test автоматически списывает деньги с карты пользователя и оповещает пользователя об успешном погашении или остаточной задолженности. Дабы избежать просрочки, просим заблаговременно пополнять лицевой счёт и иметь средства на карте.</p>',
    'section_how_step2_text'        => '<ol>
                                            <li>Войти в личный кабинет, нажав на кнопку "Войти"</li>
                                            <li> В блоке «Пополнение лицевого счета с карты» введите сумму, на которую хотите пополнить ваш лицевой счёт</li>
                                            <li>Нажмите на кнопку «Пополнить» и платформа test автоматически спишет с Вашей карты указанную сумму</li>
                                        </ol>',
    'section_how_step3_text'        => '<ol>
                                            <li>Нажать на любой из платежных сервисов: Payme, Click, Apelsin, Myuzcard</li>
                                            <li>Нажать на кнопку «Оплата» и в графе «Поиск» написать test и выбрать наш сервис в поставщиках услуг</li>
                                            <li>Введите свой персональный ID, сумму оплаты и нажмите на кнопку «Оплатить»</li>
                                            <li>При успешной оплате данные денежные средства будут направлены на Ваш лицевой счет. Вы можете проверить текущий лицевой счет в личном кабинете платформы test</li>
                                        </ol>',
];
