<?php
return [

    //Partner registration success
    'header_registration_success'        => 'Вы успешно зарегистрировались!',
    'text_registration_success'          => '
                                            <p class="font-weight-normal font-size-16">
                                                 После проверки нашими менеджерами вам придет СМС-сообщение с ID и ПАРОЛЬ в ваш личный кабинет.
                                             </p>',

    //Partner register
    'header_register'                   => 'Регистрация партнера',
    'header_login'                      => 'Вход партнера',

    'header_our_partners'               => 'Наши партнеры',

    'btn_all_partners'                  => 'Все партнеры',

    // Partner landing
    'btn_register'                      => 'Пройти регистрацию',
    'welcome_title'                     => 'Стать партнером',
    'welcome_text'                      => 'Лидерство в продажах синхронизирует продуктовый ассортимент. Повышение жизненных стандартов детерминирует комплексный анализ ситуации.',


    'section_how_title'                 => 'Преимущества работы с нами',

    'section_how_step1_name'            => 'Удобная и бесплатная CRM система',
    'section_how_step1_text'            => 'Множество вендоров на данный момент не имеет полнофункциональной CRM (ERP) системы. Подключаясь к системе test они могут бесплатно использовать удобный POS инструмент.',
    'section_how_step2_name'            => 'Бесплатный маркетинг',
    'section_how_step2_text'            => 'Эффективный и главное бесплатный для вендоров маркетинг и рекламные кампании. Все рекламные кампании будут также проводится для увеличения продаж вендоров.',
    'section_how_step3_name'            => 'Увеличение продаж, собственная клиентская база',
    'section_how_step3_text'            => 'Дополнительный приток клиентов которые в ином случае не могли бы позволить приобрести товар. Формируемая обширная сеть клиентов.',
    'section_how_step4_name'            => 'Доступ на региональные рынки',
    'section_how_step4_text'            => 'Централизованный и бесплатный доступ (в том числе Логистика) на региональные рынки для вендоров.',

    'section_video_title'               => 'Что дает партнерство',
    'section_video_text'                => 'Посмотрите небольшой видео-ролик, чтобы узнать о преимуществах работы с <b>test</b>',
    'section_video_play'                => 'Смотреть видео',

    'txt_no_partners'                   => 'Не найдено ниодного партнера.',


    'shop_addresses'                    => 'Адреса магазинов',
    'phone'                             => 'Телефон',
    'website'                           => 'Сайт',
    'hours'                             => 'График работы',
    'address'                           => 'Адрес',
    'hours_text'                        => 'c 10:00 до 20:00 без выходных',

    'company_products'                  => 'Продукты компании',

    'cat_status_2' => 'Одежда',
    'cat_status_3' => 'Настольные игры',
    'cat_status_4'=> 'Интернет магазин',
    'cat_status_5' => 'Обувь',
    'cat_status_6' =>'Компьютеры и комплектующие',
    'cat_status_7' =>'Строительные инструменты',
    'cat_status_8' =>'Ювелирные изделия',
    'cat_status_9' =>'Мебель для дома и офиса',
    'cat_status_10' => ' Магазин мужской одежды',
    'cat_status_11' =>'Магазин электроники',
    'cat_status_12'=> 'Спортивные товары',
    'cat_status_13' =>'Портреты и картины',
    'cat_status_14'=>'Товары для дома',
    'cat_status_15' =>'Дом швейных машин',
    'cat_status_16'=> 'Косметика',
    'cat_status_17'=> 'Мобильные телефоны и аксессуары',
    'cat_status_18' =>'Авто',
    'cat_status_19'=>'Видеонаблюдение для дома',
    'cat_status_20' =>'Двери',
    'cat_status_21'=> 'Музыкальные инструменты',
    'cat_status_22' =>'Мебель',
    'cat_status_23' => 'Канцелярские товары',
    'cat_status_24' => 'Электроскутеры',
    'cat_status_25'  =>'Магазин бытовой техники',
    'cat_status_26'  =>'Всё для офиса',
    'cat_status_27'  =>'Всё для дома',
    'cat_status_28'  =>'Офисные кресла',
    'cat_status_29'  =>'Матрасы',
    'cat_status_30'  =>'Автомобильные шины',
    'cat_status_31'  =>'Товары для детей',
    'cat_status_32'  =>'Парфюм',

];
