<?php
return [
    'h1'                        => 'Paycoin покупаете вы, платим мы!',
    'txt_registration'          => 'Зарегистрироваться',
    'txt_how_to_buy'            => 'Paycoin покупаете вы, платим мы!',


    'section_how_to_buy_title'        => 'Как купить товар?',

    'btn_register'              => 'Пройти регистрацию',
    'welcome_text'              => 'Paycoin - это сервис рассрочки, который поможет вам делать большие покупки в магазинах города и не отдавать всю сумму сразу. К нам подключено огромное количество торговых точек разных категорий товаров как в Ташкенте так и по всему Узбекистану — вполне возможно, что и ваш любимый магазин тоже.',
    'txt_how_it_works'          => 'Как работает test',

    'section_how_title'                 => 'Что понадобится для регистрации на Paycoin',
    'section_how_text'                  => 'После прохождения верификации вы получите доступ к покупке товаров наших партнеров в раcсрочку и бонусам нашей системы!',
    'section_how_step1_name'            => 'Данные',
    'section_how_step1_text'            => '<p><b>Вам необходимо будет заполнить и загрузить:</b></p>
                                            <ol>
                                                <li>Заполнить регистрационную анкету </li>
                                                <li>Селфи с паспортом</li>
                                                <li>Фото лицевой стороны паспорта</li>
                                                <li>Фото страницы прописки в паспорте</li>
                                            </ol>',
    'section_how_step2_name'            => 'Заработная пластиковая карта UZCARD / HUMO',
    'section_how_step2_text'            => '<p>Ежемесячные поступления должны превышать сумму от 1,2 млн. сумм до 3 млн. сумм ежемесячно в течении последних 6 месяцев. От этого будет зависеть размер лимита на покупку в рассрочку</p>',
    'section_how_step3_name'            => 'Мобильный телефон',
    'section_how_step3_text'            => '<p>Мобильный номер будет логином для входа. Пароль для входа придет вам в смс-собщении</p>',
    'section_how_step4_name'            => 'Лимит на покупку в рассрочку до',
    'section_how_step4_text'            => 'На ваш счет Paycoin',


    'section_how_to_buy_step1_name'     => 'Выбрать товар в магазине',
    'section_how_to_buy_step2_name'     => 'Подобрать удобные условия',
    'section_how_to_buy_step3_name'     => 'Подписать документы',
    'section_how_to_buy_step4_name'     => 'Наслаждаться покупками!',

    'section_how_to_buy_step1_text'     => '<p>Сообщить продавцу-консультанту, что Вы хотите приобрести товар(ы) в рассрочку через систему Paycoin</p>',
    'section_how_to_buy_step2_text'     => '<p>Назвать продавцу свой ID или номер мобильного телефона, зарегистрированный на платформе Paycoin, и указать на какой период Вы хотели бы приобрести товар(ы)</p>',
    'section_how_to_buy_step3_text'     => '<p>Ознакомиться с условиями рассрочки и подтвердить покупку при помощи СМС-кода, отправленного на Ваш мобильный телефон</p>
                                            <p>Подписать и получить образец акта приема-передачи товара(ов)</p>',
    'section_how_to_buy_step4_text'     => '<p>Забрать товар(ы), вносить меньшие платежи и наслаждаться будущими покупками через Paycoin без необходимости повторной регистрации</p>',

    'section_video_title'               => 'Получи доступ к товарам в рассрочку',
    'section_video_text'                => 'Посмотрите небольшой видео-ролик, чтобы узнать о преимуществах работы с <b>Paycoin</b>',
    'section_video_play'                => 'Смотреть видео',

    'section_contact'                   => 'Остались вопросы?',
    'section_contact_center'            => 'Контакт-центр',
    'section_contact_support'           => 'На Ваш вопрос уже есть ответ в разделе поддержки ',
    'section_contact_btn'               => 'Ответы на частые вопросы',
];
