<?php
return [
    'header' => 'А К Т приема-передачи Товара',
    'header_title' => 'Приложение №:number к Оферте № :offer_id c :date года и Публичной оферте.',
    'schedule' => 'График платежей',
    'reconciliation_title' => 'АКТ СВЕРКИ ВЗАИМОРАСЧЁТОВ',

    'txt_1' => 'ООО «ARHAT GRAVURE»,
        именуемое в дальнейшем «Продавец», в лице директора :vendor, действующего на основании доверенности № :offer от :date года,
        с одной Стороны, и гражданин(ка) :buyer (:passport_number от :passport_date_issue), проживающий по адресу: :address,
        именуемый в дальнейшем «Покупатель», с другой Стороны, вместе именуемые как Стороны, а по отдельности - Сторона,
        составили настоящий акт о том, что Продавец поставил, а Покупатель получил перечень товаров
        (далее – Товар) согласно нижеследующей таблице:',
    'txt_2' => '
            <ol>
                <li>Товар передан Покупателю в согласованном количестве и надлежащего качества.</li>
                <li>Покупатель подтверждает свои обязательства по оплате стоимости товара в рассрочку согласно нижеследующему графику:</li>
                <li>Покупатель заверяет Продавца, что не имеет каких-либо претензий по исполнению электронного договора купли-продажи товара в рассрочку.</li>
                <li>Настоящий Акт сформирован в Информационной системе «ZMARKET» (www.zmarket.uz), а также распечатан и подписан Сторонами в 2 (двух) экземплярах, один из которых находится у Продавца, второй - у Покупателя.</li>
            </ol>',
    'text_first' => '
        <ol>
          <li>Товар Продавцом по договору поставлен Покупателю в полном объёме и надлежащего качества.</li>
          <li>Покупатель настоящим подтверждает и обязуется оплачивать сумму приобретенного Товара, согласно нижеприведенному графику платежей:</li>
        </ol>',
    'text_second' => '
        <ol start="3">
          <li>Покупатель настоящим подтверждает, что ознакомлен с условиями договора (оферты полученной путем направления СМС со ссылкой, на номер телефона Покупателя) и принимает его условия безоговорочно. Покупатель также настоящим осознает и подтверждает, что им заключен договор купли-продажи в рассрочку товаров, и настоящий акт является частью этого договора.</li>
          <li>Покупатель дает полное согласие передавать или делиться своими личными данными и деталями данного Акта с третьими лицами.</li>
          <li>В случае неуплаты или просрочки платежей, указанных в таблице данного Акта, Покупатель дает свое согласие на добавление себя в черный список или список неплательщиков, доступ к которому будет публичным.</li>
          <li>Если со стороны Покупателя не будет своевременно и надлежащим образом исполнено обязательство по уплате долга, Продавец имеет право взыскать имеющуюся сумму задолженности и досрочно всю оставшуюся по рассрочке сумму за предоставленный Товар путём обращения к нотариусу за получением исполнительного листа.</li>
          <li>Все расходы, связанные с взысканием задолженности и с взысканием в досрочном порядке всей оставшейся суммы по рассрочке за предоставленный Товар несёт Покупатель.</li>
          <li>Стороны подтверждают, что все вопросы и претензии касательно качества, комплектации, целостности Товара урегулированы до момента подписания настоящего Акта и никакие последующие претензии касательно полученного Товара Продавцом не принимаются.</li>
          <li>Настоящий Акт написан на понятном Покупателю языке составлен в 2 (двух) экземплярах, один из которых находится у Продавца, второй - у Покупателя.</li>
        </ol>',

    'txt_vendor' => 'Сдал от ПРОДАВЦА',
    'employee_fio' => 'ФИО сотрудника',
    'fio' => 'ФИО',
    'sign' => 'Подпись',
    'region' => 'г.Ташкент',

    'txt_buyer' => 'Товар получил',
    'txt_buyer2' => 'Принял от ПОКУПАТЕЛЯ',
    'passport' => 'Серия и номер паспорта',
    'phone' => 'Телефон',
    'phone_short' => 'Тел:',

    'from_name' => 'от имени и по поручению ООО «SOLUTIONS LAB» ',
    'proxy' => 'на основании доверенности от',

    'product_name' => 'Наименование и описание Товара',
    'product_count' => 'Ед. изм. (шт. или комплект) Шт',
    'product_price' => 'Цена, (в соответствии с условиями Сделки за единицу Товара с НДС)',
    'price_all' => 'Общая стоимость с учетом рассрочки (в соответствии с условиями Договора за единицу Товара с НДС)',

    'products_total' => 'Итого на общую сумму: :total сум с НДС.',
    'docs' => 'Прилагаемые документы и упаковка (Упаковка, сертификат соответствия, гарантийный талон и др.)',

    'sum' => 'Сумма платежа (в сум, с НДС)',
    'balance' => 'Остаток платежа',
    'no' => '№',
];
