<?php
return [
    'error_status_0' => 'Успешно',
    'error_status_1' => 'Ошибка ввода/вывода. Требуется повторная отправка',
    'error_status_2' => 'Ошибка формата файла сертификата',
    'error_status_3' => 'Ошибка структуры файла, сертификата. Формирование файла не по требованиям инструкции',
    'error_status_4' => 'Ошибка сервиса. Требуется повторная отправка',
    'error_status_5' => 'Ошибка проверки подписи закреплённого сертификата. Возможно сертификат пользователя просрочен или недействителен или иная ошибка',
    'error_status_6' => 'Ошибка в структуре JSON файла платежа',
    'error_status_10' => 'Ошибка в значениях поля JSON файла платежа',
    'error_status_11' => 'Требуется отложить отправку и попытаться отправить заново',
    'error_status_500' => 'ГНК не ответил, ошибка сервера',
    'error_status_600' => 'Несоответствие ИНН',
    'error_status_unknown' => 'Неизвестная ошибка',
];

